## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.AppInsights[0].azurerm_application_insights.appinsights will be destroyed
  # (because azurerm_application_insights.appinsights is not in configuration)
  - resource "azurerm_application_insights" "appinsights" {
      - app_id                                = "af673be2-2022-4777-8685-9fad8a6d79f3" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Insights/components/appi-ecowitt-test-euw-01" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "westeurope" -> null
      - name                                  = "appi-ecowitt-test-euw-01" -> null
      - resource_group_name                   = "rg-ecowitt-test-euw" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {} -> null
      - workspace_id                          = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.OperationalInsights/workspaces/log-ecowitt-test-euw-01" -> null
    }

  # module.AzureFunction.azurerm_storage_account.fapp-data will be destroyed
  # (because azurerm_storage_account.fapp-data is not in configuration)
  - resource "azurerm_storage_account" "fapp-data" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "ZRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = false -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = false -> null
      - location                           = "westeurope" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "saecowittdatatesteuw01" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://saecowittdatatesteuw01.blob.core.windows.net/" -> null
      - primary_blob_host                  = "saecowittdatatesteuw01.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://saecowittdatatesteuw01.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "saecowittdatatesteuw01.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://saecowittdatatesteuw01.file.core.windows.net/" -> null
      - primary_file_host                  = "saecowittdatatesteuw01.file.core.windows.net" -> null
      - primary_location                   = "westeurope" -> null
      - primary_queue_endpoint             = "https://saecowittdatatesteuw01.queue.core.windows.net/" -> null
      - primary_queue_host                 = "saecowittdatatesteuw01.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://saecowittdatatesteuw01.table.core.windows.net/" -> null
      - primary_table_host                 = "saecowittdatatesteuw01.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://saecowittdatatesteuw01.z6.web.core.windows.net/" -> null
      - primary_web_host                   = "saecowittdatatesteuw01.z6.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "rg-ecowitt-test-euw" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = false -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {} -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.AzureFunction.azurerm_windows_function_app.fapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "fapp" {
      ~ app_settings                                   = {
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"          = "true" -> null
          - "WEBSITE_RUN_FROM_PACKAGE"                 = "1" -> null
            # (7 unchanged elements hidden)
        }
        id                                             = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Web/sites/fa-ecowitt-test-euw"
        name                                           = "fa-ecowitt-test-euw"
        tags                                           = {}
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ application_insights_connection_string = (sensitive value)
          ~ application_insights_key               = (sensitive value)
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.DataAccount.azurerm_storage_account.data_sa will be created
  + resource "azurerm_storage_account" "data_sa" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = false
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "saecowittdatatesteuw01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-ecowitt-test-euw"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.DataAccount.azurerm_storage_container.config_blob_container will be created
  + resource "azurerm_storage_container" "config_blob_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "config"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.DataAccount.azurerm_storage_container.data_blob_container will be created
  + resource "azurerm_storage_container" "data_blob_container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "data"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.LAW[0].azurerm_log_analytics_workspace.law will be destroyed
  # (because azurerm_log_analytics_workspace.law is not in configuration)
  - resource "azurerm_log_analytics_workspace" "law" {
      - allow_resource_only_permissions         = true -> null
      - cmk_for_query_forced                    = false -> null
      - daily_quota_gb                          = 1 -> null
      - id                                      = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.OperationalInsights/workspaces/log-ecowitt-test-euw-01" -> null
      - immediate_data_purge_on_30_days_enabled = false -> null
      - internet_ingestion_enabled              = true -> null
      - internet_query_enabled                  = true -> null
      - local_authentication_disabled           = false -> null
      - location                                = "westeurope" -> null
      - name                                    = "log-ecowitt-test-euw-01" -> null
      - primary_shared_key                      = (sensitive value) -> null
      - resource_group_name                     = "rg-ecowitt-test-euw" -> null
      - retention_in_days                       = 30 -> null
      - secondary_shared_key                    = (sensitive value) -> null
      - sku                                     = "PerGB2018" -> null
      - tags                                    = {} -> null
      - workspace_id                            = "987311fe-8bb6-4c7c-90a6-680da55d7468" -> null
        # (1 unchanged attribute hidden)
    }

  # module.Logging[0].azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westeurope"
      + name                                = "appi-ecowitt-test-euw-01"
      + resource_group_name                 = "rg-ecowitt-test-euw"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.Logging[0].azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = 1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "westeurope"
      + name                            = "log-ecowitt-test-euw-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-ecowitt-test-euw"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 5 to add, 1 to change, 3 to destroy.
```
</details>